backend/controllers/OudeController.php

	public function actionEdit() // render view edit và gửi kèm những dữ liệu để hiện các dropdownlist
	{
		$allGraduationSemester = GraduationSemester::find()->select(['chi_tiet_hk'])->indexBy('ma_hk')->column(); // lấy tất cả học kì hiện có trong database để thêm vào dropdownlist

		$allNation = Nation::find()->select(['ten_dan_toc'])->indexBy('ma_dt')->column(); // lấy tất cả dân tộc

		$allProvince = Province::find()->select(['ten_tinh_thanh_at'])->indexBy('ma_tinh_thanh')->column(); // lấy tất cả tên tỉnh thành

		$allCountry = Country::find()->select(['ten_quoc_tich'])->indexBy('ma_qt')->column(); // lấy tất cả tên quốc tịch

		$allLinkedUnit = LinkedUnit::find()->select(['ten_dvlk'])->indexBy('ma_dvlk')->column(); // lấy tất cả tên đơn vị liên kết

		$allMajor = Major::find()->select(['ten_nganh'])->indexBy('ma_nganh')->column(); // lấy tất cả tên ngành
---
SELECT `ten_dan_toc`, `tb_dan_toc`.`ma_dt` FROM `tb_dan_toc`
SELECT `ten_tinh_thanh_at`, `tb_tinh_thanh`.`ma_tinh_thanh` FROM `tb_tinh_thanh`
SELECT `ten_quoc_tich`, `tb_quoc_tich`.`ma_qt` FROM `tb_quoc_tich`
SELECT `ten_nganh`, `tb_nganh`.`ma_nganh` FROM `tb_nganh`

	public function actionShowDetailToEdit($mssv, $hk) // khi có kết quả tìm kiếm , khi nhấn vào 1 sinh viên sẽ hiện dialog chứa thông tin của sinh viên đó để cập nhập
	{
		if(\Yii::$app->request->isAjax)
		{

			\Yii::$app->response->format = Response::FORMAT_JSON;

			$detailStudent = StudentSemester::find()
							->where([
								'tb_sv_hk.mssv' => $mssv,
								'tb_sv_hk.ma_hk' => $hk
							])
							->limit(1)
							->one(); // trả về đúng 1 sinh viên theo kết quả tìm kiếm
---
SELECT * FROM `tb_sv_hk` WHERE (`tb_sv_hk`.`mssv`='1a2b3c4d') AND (`tb_sv_hk`.`ma_hk`='tn_193') LIMIT 1

	public function actionGetDataToDelete() // nhận dữ liệu để xóa sinh viên
	{
		if(\Yii::$app->request->isAjax)
		{
			\Yii::$app->response->format = Response::FORMAT_JSON;

			$mssv = \Yii::$app->request->post('mssv');

			$hk = \Yii::$app->request->post('hk');

			//$findStudentToDelete = Student::findOne(mssv);
			$findStudentToDelete = Student::find()
									->innerJoinWith('graduationSemesters')
									->where(['tb_sinh_vien.mssv' => $mssv])
									->one();

			$checkIfStudentHasManySemester = $findStudentToDelete->graduationSemesters; // kiểm tra xem 1 sinh viên có nhiều học kì hay không
			$checkIfDeleteSuccess = true; // cờ để xác định xóa thành công
			if (count($checkIfStudentHasManySemester) > 1)
			{
				$semesterStudent = StudentSemester::find($mssv)
									->where([
										'tb_sv_hk.mssv' => $mssv,
										'tb_sv_hk.ma_hk' => $hk
									])
									->limit(1)
									->one(); // trả về đúng 1 sinh viên theo kết quả tìm kiếm
---
SELECT `tb_sinh_vien`.* FROM `tb_sinh_vien` INNER JOIN `tb_sv_hk` ON `tb_sinh_vien`.`mssv` = `tb_sv_hk`.`mssv` INNER JOIN `tb_hk_tot_nghiep` ON `tb_sv_hk`.`ma_hk` = `tb_hk_tot_nghiep`.`ma_hk` WHERE `tb_sinh_vien`.`mssv` LIKE '%165%'
SELECT * FROM `tb_sv_hk` WHERE (`tb_sv_hk`.`mssv`='1a2b3c4d') AND (`tb_sv_hk`.`ma_hk`='tn_193') LIMIT 1

	public function actionGetDataToEdit() // lấy những trường dữ liệu tương ứng để gửi sang Graduation để cập nhật
	{
		if(\Yii::$app->request->isAjax)
		{

			\Yii::$app->response->format = Response::FORMAT_JSON;

			$data = \Yii::$app->request->post('data');

			$student = Student::findOne($data[0]);

			$studentRecord = StudentRecord::findOne($data[0]); // $data[0] là mssv

			$semesterStudent = StudentSemester::find($data[0])
								->where([
									'tb_sv_hk.mssv' => $data[0],
									'tb_sv_hk.ma_hk' => $data[19] // $data[19] là học kì
								])
								->limit(1)
								->one(); // trả về đúng 1 sinh viên theo kết quả tìm kiếm
---
SELECT * FROM `tb_sv_hk` WHERE (`tb_sv_hk`.`mssv`='32163013VT2') AND (`tb_sv_hk`.`ma_hk`='tn_193') LIMIT 1


				if ($model->semester == 'all')
				{
					$allStudentInSemester = Student::find()
								->innerJoinWith('graduationSemesters')
								->andFilterWhere(['like', 'tb_sinh_vien.mssv', $model->mssv])
								->andFilterWhere(['or', ['like', 'CONCAT(tb_sinh_vien.ho, " ", tb_sinh_vien.ten)', $model->username], ['like', 'CONCAT(tb_sinh_vien.ho_kd, " ", tb_sinh_vien.ten_kd)' , $model->username]])
---
SELECT `tb_sinh_vien`.* FROM `tb_sinh_vien` INNER JOIN `tb_sv_hk` ON `tb_sinh_vien`.`mssv` = `tb_sv_hk`.`mssv` INNER JOIN `tb_hk_tot_nghiep` ON `tb_sv_hk`.`ma_hk` = `tb_hk_tot_nghiep`.`ma_hk` WHERE `tb_sinh_vien`.`mssv` LIKE '%32163013%'