backend/controllers/OudeController.php

				}
				else
				{
					$allStudentInSemester = Student::find()
								->innerJoinWith('graduationSemesters')
								->where(['tb_hk_tot_nghiep.ma_hk' => $model->semester])
								->andFilterWhere(['like', 'tb_sinh_vien.mssv', $model->mssv])
								->andFilterWhere(['or', ['like', 'CONCAT(tb_sinh_vien.ho, " ", tb_sinh_vien.ten)', $model->username], ['like', 'CONCAT(tb_sinh_vien.ho_kd, " ", tb_sinh_vien.ten_kd)' , $model->username]])

								->all();

					$detailSemester = GraduationSemester::find()
							->where(['tb_hk_tot_nghiep.ma_hk' => $model->semester])
							->one();
---
SELECT `tb_sinh_vien`.* FROM `tb_sinh_vien` INNER JOIN `tb_sv_hk` ON `tb_sinh_vien`.`mssv` = `tb_sv_hk`.`mssv` INNER JOIN `tb_hk_tot_nghiep` ON `tb_sv_hk`.`ma_hk` = `tb_hk_tot_nghiep`.`ma_hk` WHERE `tb_sinh_vien`.`mssv` LIKE '%165%'
SELECT * FROM `tb_hk_tot_nghiep` WHERE `ma_hk` IN ('tn_193', 'tn_194')