frontend/controllers/OudeController.php

				{
					$allStudentInSemester = Student::find()

								->innerJoinWith('province')
								->where(['like', 'tb_sinh_vien.mssv', $model->mssv])
								->andFilterWhere(['or', ['like', 'CONCAT(tb_sinh_vien.ho, " ", tb_sinh_vien.ten)', $model->username], ['like', 'CONCAT(tb_sinh_vien.ho_kd, " ", tb_sinh_vien.ten_kd)' , $model->username]])
								->with(['province'])
								->all();
---
SELECT `tb_sinh_vien`.* FROM `tb_sinh_vien` INNER JOIN `tb_ho_so_sv` ON `tb_sinh_vien`.`mssv` = `tb_ho_so_sv`.`mssv` INNER JOIN `tb_tinh_thanh` ON `tb_ho_so_sv`.`ma_noi_sinh` = `tb_tinh_thanh`.`ma_tinh_thanh` WHERE `tb_sinh_vien`.`mssv` LIKE '%3216%'

				}
				else
				{
					$allStudentInSemester = Student::find()
								->innerJoinWith('graduationSemesters')
								->innerJoinWith('province')
								->where(['tb_hk_tot_nghiep.ma_hk' => $model->semester])
								->andWhere(['like', 'tb_sinh_vien.mssv', $model->mssv])
								->andFilterWhere(['or', ['like', 'CONCAT(tb_sinh_vien.ho, " ", tb_sinh_vien.ten)', $model->username], ['like', 'CONCAT(tb_sinh_vien.ho_kd, " ", tb_sinh_vien.ten_kd)' , $model->username]])
								->all();

					$detailSemester = GraduationSemester::find()
							->where(['tb_hk_tot_nghiep.ma_hk' => $model->semester])
							->one();
---
SELECT `tb_sinh_vien`.* FROM `tb_sinh_vien` INNER JOIN `tb_sv_hk` ON `tb_sinh_vien`.`mssv` = `tb_sv_hk`.`mssv` INNER JOIN `tb_hk_tot_nghiep` ON `tb_sv_hk`.`ma_hk` = `tb_hk_tot_nghiep`.`ma_hk` INNER JOIN `tb_ho_so_sv` ON `tb_sinh_vien`.`mssv` = `tb_ho_so_sv`.`mssv` INNER JOIN `tb_tinh_thanh` ON `tb_ho_so_sv`.`ma_noi_sinh` = `tb_tinh_thanh`.`ma_tinh_thanh` WHERE (`tb_hk_tot_nghiep`.`ma_hk`='tn_193') AND (`tb_sinh_vien`.`mssv` LIKE '%3216%')
SELECT * FROM `tb_hk_tot_nghiep` WHERE `tb_hk_tot_nghiep`.`ma_hk`='tn_193'